IDENTIFICATION DIVISION.
PROGRAM-ID. AOC0102.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    78 N VALUE 200.
    01 INP PIC X(4).
    01 ARRAY.
        05 A PIC 9(4) OCCURS N TIMES.
    01 I PIC 9(4).
    01 J PIC 9(4).
    01 K PIC 9(4).
    01 ANSWER PIC 9(8).

PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I = N
        ACCEPT INP
        UNSTRING INP
           INTO A(I)
    END-PERFORM.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I = N
        PERFORM VARYING J FROM 1 BY 1 UNTIL J = N
            PERFORM VARYING K FROM 1 BY 1 UNTIL K = N
                IF A(I) + A(J) + A(K) = 2020 THEN
                    MULTIPLY A(I) BY A(J) GIVING ANSWER
                    MULTIPLY ANSWER BY A(K) GIVING ANSWER
                    DISPLAY ANSWER
                    STOP RUN
                END-IF
            END-PERFORM
        END-PERFORM
    END-PERFORM.
